# EnergyAnalysisSillHeight Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..EnergyAnalysisSillHeight Property
ParameterTypeId Class See Also
---
"Target Sill Height"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId EnergyAnalysisSillHeight { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property EnergyAnalysisSillHeight As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ EnergyAnalysisSillHeight {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace